import numpy as np
import matplotlib.pyplot as plt

plt.rc("font", family="Microsoft YaHei")

# fmt: off
heights = np.array([
    170, 163, 174, 164, 159, 168, 165, 171, 171, 167, 
    165, 161, 175, 170, 174, 170, 174, 170, 173, 173, 
    167, 169, 173, 153, 165, 169, 158, 166, 164, 173, 
    162, 171, 173, 171, 165, 152, 163, 170, 171, 163, 
    165, 166, 155, 155, 171, 161, 167, 172, 164, 155, 
    168, 171, 173, 169, 165, 162, 168, 177, 174, 178, 
    161, 180, 155, 155, 166, 175, 159, 169, 165, 174, 
    175, 160, 152, 168, 164, 175, 168, 183, 166, 166, 
    182, 174, 167, 168, 176, 170, 169, 173, 177, 168, 
    172, 159, 173, 185, 161, 170, 170, 184, 171, 172
])

plt.figure(figsize=(6, 4), dpi=120)


plt.hist(heights, bins=np.arange(145, 196, 5), color='darkcyan', density=True, cumulative=True)

plt.xlabel('身高')
plt.ylabel('概率密度')
plt.show()
